sepinedas/home-weather-station/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# --- LVGL: monochrome (1bpp) rendering for the SSD1680 e-paper panel ---
CONFIG_LV_COLOR_DEPTH_1=y

# lvgl_ui.c drives lv_tick_inc() itself from esp_timer, so no custom tick
# Kconfig is needed here (and none of it is picked up on a build that
# already has a cached sdkconfig from before this component existed).

# Fonts used by the clock UI (time, date, AM/PM badge)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

CONFIG_LV_MEM_SIZE_KILOBYTES=48
